# Дано целое число. Вывести его строку-описание вида 
# «отрицательное четное число», «нулевое число», «положительное нечетное число» и т. д.

# --- Ввод и проверка числа ---
num = input("Введите целое число: ")
while type(num) != int: # обработка исключений
    try:
        num = int(num)
    except ValueError:
        print("Неправильно ввели!")
        num = input("Введите целое число: ")

# --- Логика составления описания ---
if num == 0:
    # Отдельно обрабатываем ноль (он не является ни положительным, ни отрицательным)
    print("Нулевое число.")
else:
    # 1. Определяем знак числа
    if num > 0:
        sign = "положительное"
    else:
        sign = "отрицательное"
        
    # 2. Определяем четность числа
    if num % 2 == 0:
        parity = "четное"
    else:
        parity = "нечетное"
        
    # 3. Выводим итоговую строку. 
    print(f"{sign} {parity} число.")
