# Даны три целых числа: A, B, C. Проверить истинность высказывания:
# «Каждое из чисел A, B, C положительное».

#  Ввод и проверка числа A
a = input("Введите первое целое число A: ")
while type(a) != int: # обработка исключений
    try:
        a = int(a)
    except ValueError:
        print("Неправильно ввели!")
        a = input("Введите первое целое число A: ")

# Ввод и проверка числа B
b = input("Введите второе целое число B: ")
while type(b) != int: # обработка исключений
    try:
        b = int(b)
    except ValueError:
        print("Неправильно ввели!")
        b = input("Введите второе целое число B: ")

#  Ввод и проверка числа C
c = input("Введите третье целое число C: ")
while type(c) != int: # обработка исключений
    try:
        c = int(c)
    except ValueError:
        print("Неправильно ввели!")
        c = input("Введите третье целое число C: ")

# Логическая проверка 
if a > 0 and b > 0 and c > 0:
    print("Истина. Каждое из чисел A, B, C является положительным.")
else:
    print("Ложь. Не все числа являются положительными.")
